Revit 2027 API
BuiltInFailures.AutoRouteFailures.NoFittingInProjectError Property
 The routing solution failed because there is no default fitting type specified or the fitting cannot be found in the project. Ensure the fitting is loaded in the project and try again.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoFittingInProjectError { get; }
Public Shared ReadOnly Property NoFittingInProjectError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoFittingInProjectError {
	FailureDefinitionId^ get ();
}
static member NoFittingInProjectError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace